Revit 2024 API
SpatialElementFromToCalculationPoints.FromPosition Property
 The "from" position of spatial element connecting calculation point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ FromPosition { get; set; }
Visual Basic
Public Property FromPosition As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ FromPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: fromPosition must be on the opposite side of the family's host from the "to" position.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
SpatialElementFromToCalculationPoints Class
Autodesk.Revit.DB Namespace